Start with the name of Allah who is the most Benefical and most Merciful

In [1]:
import numpy as np
import pandas as pd

In [2]:
obj = pd.Series([1,2,3,4])

In [3]:
obj

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
obj.values

array([1, 2, 3, 4], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([1,6,-5,3],index=["a","b","c","d"])

In [7]:
obj2

a    1
b    6
c   -5
d    3
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
obj2["a"]

1

In [10]:
obj2["c"]

-5

In [11]:
obj2[ ["a","b","d"] ]

a    1
b    6
d    3
dtype: int64

In [12]:
obj[obj<2]

0    1
dtype: int64

In [13]:
obj2*2

a     2
b    12
c   -10
d     6
dtype: int64

In [14]:
np.exp(obj2)

a      2.718282
b    403.428793
c      0.006738
d     20.085537
dtype: float64

In [15]:
"b" in obj2

True

In [16]:
"c" in obj2

True

In [17]:
sdata = {"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}

In [18]:
obj3 = pd.Series(sdata)

In [19]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [20]:
states = ["California","Ohio","Oregon","Texas"]
obj4 = pd.Series(sdata,index=states)

In [21]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [22]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [23]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [24]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [25]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [28]:
obj4.name = "population"

In [29]:
obj4.index.name = "State"

In [30]:
obj4

State
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [31]:
obj

0    1
1    2
2    3
3    4
dtype: int64

In [32]:
obj.index=['Bob', 'Steve', 'Jeff', 'Ryan']

In [33]:
obj

Bob      1
Steve    2
Jeff     3
Ryan     4
dtype: int64

# DataFrame

In [34]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [36]:
pd.DataFrame(frame,columns=["state","year","pop"])

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [37]:
frame2 = pd.DataFrame(data,columns=["year","state","pop","debt"],index=["one","two","three","four","five","six"])

In [38]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [39]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [40]:
frame2["state"]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [41]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [42]:
frame2.loc["three"]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [43]:
frame2["debt"] = 16

In [44]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5    16
two    2001    Ohio  1.7    16
three  2002    Ohio  3.6    16
four   2001  Nevada  2.4    16
five   2002  Nevada  2.9    16
six    2003  Nevada  3.2    16

In [45]:
frame2["debt"] = np.arange(6.)

In [46]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [47]:
val = pd.Series([3,-1,2],index=["two","four","six"])

In [48]:
frame2["debt"] = val

In [49]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7   3.0
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.0
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   2.0

In [50]:
frame2["eastern"]=frame2.state=="Ohio"

In [51]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7   3.0     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.0    False
five   2002  Nevada  2.9   NaN    False
six    2003  Nevada  3.2   2.0    False

In [52]:
del frame2["eastern"]

In [53]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7   3.0
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.0
five   2002  Nevada  2.9   NaN
six    2003  Nevada  3.2   2.0

In [54]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [55]:
pop = { "Nevada":{2001: 2.4, 2002: 2.9},
        "Ohio":{2000: 1.5, 2001: 1.7, 2002: 3.6} }

In [56]:
frame3 = pd.DataFrame(pop)

In [57]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [58]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [59]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [60]:
pd.DataFrame(frame3,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [61]:
pdata = {"Ohio":frame3["Ohio"][:-1],
         "Nevada":frame3["Nevada"][:2]  }
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [62]:
frame3.index.name="year";frame3.columns.name="state"

In [63]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [64]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [65]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, 3.0],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.0],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, 2.0]], dtype=object)

# Index Objects

In [66]:
obj=pd.Series(range(3),index=["a","b","c"] )
index=obj.index

In [67]:
index

Index(['a', 'b', 'c'], dtype='object')

In [68]:
index[1:]

Index(['b', 'c'], dtype='object')

In [69]:
#index[1]="d"         this is error it doesnt share index object

In [70]:
labels = pd.Index(np.arange(3))

In [71]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [72]:
obj2 = pd.Series( [1,2,3],index=labels)

In [73]:
obj2

0    1
1    2
2    3
dtype: int64

In [74]:
obj2.index is labels

True

In [75]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [76]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [77]:
"Ohio" in frame3.columns

True

In [78]:
2000 in frame3.index

True

In [79]:
dup_labels = pd.Index(["foo","foo","bar","bar"])
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')